modules/Car/Models/Car.php

    public function getDatesInRange($start_date,$end_date)
    {
        $query = $this->carDateClass::query();
        $query->where('target_id',$this->id);
        $query->where('start_date','>=',date('Y-m-d H:i:s',strtotime($start_date)));
        $query->where('end_date','<=',date('Y-m-d H:i:s',strtotime($end_date)));

        return $query->take(100)->get();
---
select * from `bravo_car_dates` where `target_id` = 13 and `start_date` >= '2025-03-23 00:00:00' and `end_date` <= '2025-03-30 00:00:00' limit 100

    public function hasWishList(){
        return $this->hasOne($this->userWishListClass, 'object_id','id')->where('object_model' , $this->type)->where('user_id' , Auth::id() ?? 0);
---
select * from `user_wishlist` where `user_wishlist`.`object_id` = 1 and `user_wishlist`.`object_id` is not null and `object_model` = 'car' and `user_id` = 6 limit 1